tutorials/incompressibleVoF/mixerVessel/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    nonCouple
    {
        type        faceZone;
        zoneName    rotating;

        owner
        {
            name        nonCouple1;
            type        patch;
        }

        neighbour
        {
            name        nonCouple2;
            type        patch;
        }
    }
}


// ************************************************************************* //
